<?php
/** @noinspection ALL */
$txtset = 'Settings'; // Настройки
$txtacc = 'Аккаунты';
$txtacci = 'Выбирайте действия с аккаунтами.  ';
$txtsett = 'Основные настройки. Установите язык инструкций, измените логин и пароль для входа в панель';
$txtaddpr = " Формат в котором должны быть записаны прокси:<br/><strong>protocol://login:pass@ip:port</strong> - для
                прокси с логином/паролем<br/><strong>protocol://ip:port</strong> - для прокси без
                логина/пароля<br/><span class='text-danger'>Важно:</span> если у вас http или https прокси, то это не указывайте!!!";
$txtnewline = 'Each entry with a new line';
$txtcomm = 'comment';
$txtaddacc1 = 'Формат в котором должны быть записаны аккаунты<br/><strong>login;password;mail;password mail;IMAP
                    pass;2fa;Phone;JSON cookie</strong><br>
                Если не создана группа <br>';
$txtaddacc2 = 'Если не создан сервер';
$txtaddacc3 = 'На какой сервер добавить аккаунты';
$txtaddacc4 = 'В Какую группу добавить аккаунты';
$txtnoreq = 'Не обязательно';
$txtaddacc = 'Добавить аккаунты';
$txtlogin = 'Выберите опции логина.';
$txtlogin1 = 'Сбор информации одноразово';
$txtlogin2 = 'Удалять телефон если подключена почта';
$txtlogin3 = 'Быстрый логин (без определения и прохождения бана)';
$txtlogin4 = 'Сбор токена';
$txtlogin5 = 'Максимум invite за 24 часа';
$txtlogin6 = 'Максимум like за 24 часа';
$txtlogin7 = 'Максимум комментариев за 24 часа';
$txtlogin8 = 'Максимум личных сообщений за 24 часа';
$txtlogin9 = 'Запуск задач не раньше чем через секунд после предыдущей';
$txtlogin10 = 'Максимум приема в друзья в сутки';
$txtaddpr = 'Добавить прокси';
$txtlogin10 = 'Разрешить работу без прокси';
$txtlogin11 = 'Выполнить get запрос Для смены IP модема';
$txtlogin12 = 'Выполнить файл changeip.bat. Для смены IP модема ';
$txtcook = 'Опции фарма cookies';
$txtcook2 = 'Количество сайтов';
$txtcook3 = 'Список сайтов';
$txtaddpr1 = 'Добавление прокси. Формат 
<p>http://username:password@hostname:9090</p>
<p>socks5://username:password@hostname:9090</p>
<p>http://username:password@hostname:9090|link</p>
<p>socks5://username:password@hostname:9090|link</p>';
$txttask1 = 'Выберите и настройте действия.';
$txttask2 = 'Фарм cookie';
$txttask3 = 'Фарм интересов';
$txttask4 = 'Прокачка новорегов';
$txttask5 = 'Приглашение предложенных';
$txttask6 = 'Инвайт из групп';
$txttask7 = 'Удалить из друзей';
$txttask8 = 'Пригласить друзей на страницу';
$txttask9 = 'Пригласить друзей в группу';
$txttask10 = 'Пригласить друзей на донат';
$txttask11 = 'Постить в профиль';
$txttask12 = 'Вступить в группы';
$txttask13 = 'Постинг в группы';
$txttask14 = 'Комментирование';
$txttask15 = 'Лайкинг публикаций';
$txttask16 = 'Заполнение аккаунтов';
$txttask17 = 'Like2Fan';
$txttask18 = 'Рассылка лички';
$txttask19 = 'Голосование';
$txttask20 = 'Установка или замена почты';
$txttask21 = 'Прием в друзья';
$txttask22 = 'Очистка профиля от постов';
$txttask23 = 'Создание страниц';
$txttask24 = 'Сбор личных сообщений';
$txttask25 = 'Сбор комментариев для ответов';
$txttask26 = 'Поздравление с Днем рождения';
$txttask27 = 'Личка комментаторам на странице';
$txttask28 = 'Банхаммер';
$txttask31 = 'Удалить инвайты';
$txtifg1 = 'Инвайт в друзья из групп';
$txtifg2 = 'Выберите опции приглашения в друзья из групп. Вам необходим список нужных групп. При необходимости Блек лист для игнорирования людей для приглашения, Списки для фильтров, список гео';
$txtgr = 'Список групп';
$txtigr = 'Вид инвайта';
$txtgeo = 'Список Гео';
$txtfilter = 'Фильтры';
$txtfilter1 = 'Сделайте выбор при настройке фильтров имен. ALL - приглашать всех. Cyr - только кириллистические имена с учетом i. Lat - только латинские имена. Cyr + Lat - имена латиницей и кирилицей. Black - черный список имен - приглашает если имени или фамилии нет в списке. White - приглашает если имя или фамилия есть в списке. Black + White - Сначала проверяется наличие в черном списке, потом в белом списке.';
$txtfarmi1 = 'Настройте режим Фарм интересов. Режим для того, чтоб Facebook дал интересы аккаунту, начал показывать рекламу и облегчил запуск рекламных компаний.';
$txtfarmi2 = 'Выберите список ключевых слов';
$txtfarmi3 = 'Подписываться на страницы';
$txtfarmi4 = 'Количество страниц';
$txtfarmi5 = 'Вступить в группы';
$txtfarmi6 = 'Количество групп';
$txtfarmi7 = 'Гулять по ленте';
$txtfarmi8 = 'Сколько постов лайкать в ленте';
$txtfarmi9 = 'Лайкать рекламу?';
$txtfarmi10 = 'Процент лайка рекламы';
$txtfarmi11 = 'Сколько раз в день запускать?';
$txtfilter2 = 'Выберите фильтр имен';
$txttask29 = 'Фильтр имен';
$txtfilter4 = 'Количество конфирмов';
$txtbl = 'Выберите Black list';
$txtgri1 = 'Максимальное приглашений за день';
$txtgri2 = 'Количество приглашений за 1 запуск';
$txtass = 'Принять в друзья';
$txtass1 = 'Выберите настройки режима';
$txtpause = 'Пауза';
$txtass2 = 'Действий за 1 запуск';
$txtfarmi0 = 'Фарм интересов';
$txtipage = 'Пригласить на страницы';
$txtipage1 = 'Внимание. Не делайте большие списки страниц. У Фейсбука есть ограничения. Обычно для режима используется 1-3 страницы. Иначе будет большой разброс приглашенных.';
$txtipage2 = 'Список страниц';
$txtipage3 = 'Режим приглашения';
$txtipage4 = 'Количество приглашений за раз';
$txtoptions = 'Глобальные настройки комбайна';
$txtoptions1 = 'Максимальное количество аккаунтов на одной прокси одновременно в работе';
$txtoptions2 = 'Глобальные';
$txtoptions3 = 'Глобальные';
$txtlogin11 = 'Максимум приемов в друзья';
$txtaccounts = 'Добавить задание';
$txtaccounts1 = 'Установить состояние "Свободен"';
$txtaccounts2 = 'Разрешить работу без прокси';
$txtaccounts3 = '[Что делать с отмеченными]';
$txtaccounts9 = 'All acc proxy free';
$txtaccounts4 = 'ВНИМАНИЕ!!! Для всех аккаунтов изменится настройка прокси';
$txtaccounts5 = 'ВНИМАНИЕ!!! Удалить аккаунты???';
$txtaccounts6 = 'Прокси ON - прокси привязана. NO - прокси не привязана. FREE - запускать без прокси.';
$txtaccounts7 = 'USE. WORK - аккаунт в работе. Если было зависание и не изменился статус - установите статус "СВОБОДЕН" в меню';
$txtaccounts8 = 'Использовать прокси. Перепривязать прокси';
$txtlogin13 = 'Если нет аватарки установить из папки?';
$txterinv = "Удаление приглашений";
$txterinv1 = 'Facebook не позволяет посылать инвайты, ели у вас неотвеченных 1000 приглашений. Удалить неотвеченные приглашения можно в этом режиме. Режим исполняется 1 раз и удаляется из задач';
$txterinv2 = 'Сколько приглашений удалять?';
$txtlogin14 = 'Фото селфи по умолчанию. Мужские или Женские ';
$txtlogin15 = 'Время в секундах сколько ждать до закрытия аккаунта после окончания работы ';
$txtlogin16 = 'Удалить все задания у выделенных аккаунтов';
$txttask30 = 'Добавить почту';
$txtmail1 = "Положите в корень рабочей папки текстовый файл <strong>mail.txt</strong> в формате <p>login;password</p> или <p>login;password;imap_password</p><p>Режим выполняется один раз и удаляется из списка задач</p>";
$txtmail2 = 'Менять почту если уже была удачная замена почты на аккаунте?';
$txtaccounts40 = 'Переместить в группу ';
$txtaccounts41 = 'Переместить на сервер ';
$txtnewacc = "Прокачка новорегов";
$txtnewacc1 = "<p>Этот режим приглашает из поиска людей с нужным вам гео. Этим формируется список предложенных нужных вам и получаются первые друзья наиболее безопасным образом.</p>
<p>В поиске задается имя и сопоставляется с ID. Либо если нет подходящего ID проверяется гео аккаунта и если оно подходит, то данный человек приглашается. </p>
<p>Обязательно выберите список для первоначального инвайта на аккаунты в виде Имя;ID  Если список не создан - создайте в категории ID Lists. Выберите список нужных гео. Если списка еще нет, то создайте в категории GEO Lists. Заполните остальные поля</p> ";
$txtnewacc2 = "Выберите список кого приглашать";
$txtnewacc3 = "Выберите список подходящих гео.";
$txtnewacc4 = "Количество инвайтов за один запуск.";
$txtnewacc5 = "Пауза в секундах  от и до. Например 5-10 .";
$txtnewacc6 = "Количество предупреждений от Facebook за один запуск";
$txtinv3 = "Инвайт предложенных";
$txtinv30 = "Выберите нужное гео. Выберите фильтр по именам. Укажите использовать ли глобальный черный список, чтобы аккаунты не приглашали одних и тех же. Данный режим для приглашения людей, каких прелагает в друзья facebook";
$txtinv31 = "Список гео";
$txtinv32 = "Список имен - Блек лист";
$txtinv33 = "Список имен - Вайт лист";
$txtinv34 = "Использовать глобальный блек лист";
$txtglobali = "Глобальные настройки инвайта";
$txtglobali1 = '<p>Настройте приоритет работы с друзьями. Выберите порядок действий. Ненастроенные далее режимы будут игнорироваться.</p><p>Логика действий. Если в очереди действий стоит инвайт, то проверяются данные настройки. И отрабатывает режим здесь установленный. Но если в режиме некого пригласить, то идет переход к следующему режиму.</p><p><strong>Если вы не инвайтите, то просто пропустите данные настройки и нажмите ACTIVATE<strong></p>';
$txtglobali2 = "Первое действие";
$txtglobali3 = "Второе действие";
$txtglobali4 = "Третье действие";
$txtglobali5 = "Четвертое действие";
$txtglobali6 = "Пятое действие";
$txtglobali14 = "Шестое действие";
$txtglobali7 = "Приглашение с постов";
$txtglobali8 = "Приглашение предложенных";
$txtglobali9 = "Приглашение с групп";
$txtglobali10 = "Инвайт 1";
$txtglobali11 = "Прокачка новорегов";
$txtglobali12 = "Принятие в друзья";
$txtglobali13 = "STOP";
$txtglobali14 = "Активные с постов";
$txtglobali15 = "Рядом со мной";
$txtglobali16 = "STOP";
$txtglobali17 = "Если используете режим <strong>Рядом со мной</strong> вы должны состоять в группе. И у вашего аккаунта должен установлен город проживания. Заполните аккаунт. И сначала подайте заявки на вступление и выберите режим групп <strong>Группы в каких состаю</strong>";
$txtglobali18 = "Группы в которых состою";
$txtglobali19 = "Приглашение с групп";
$txtglobali20 = "Источник инвайта";
$txtglobali21 = "Вид инвайта";
$txtedlist = '<p></p><strong>Каждая запись с новой строки</strong></p>
                <p><strong>Не добавляйте за 1 раз более 5000 записей</strong></p>';

$txtedlist2 = " записей. Отображены первые записи не более 1000";
$txterr = 'Ошибки шаблона за последние 48 часов';
$txterr1 = 'Сделать отчет';
$txterr2 = 'Отправить разработчику';
$txtmen = "Заполнение аккаунта.";
$txtfill = "Укажите нужные списки. Задача будет запущена один раз и удалится из заданий. Если вы хотите установить для аккаунта Cover (Install cover), то разместите картинки в Рабочая папка/cover";
$txtfill2 = "Укажите город рождения и проживания.";
$txtfill3 = "Укажите место работы.";
$txtfill4 = "Укажите место учебы.";
$txtfill5 = 'Не заполнять';  // !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
$txterr3 = 'Очистить список ошибок';
$txtaddgr = 'Введите имя группы аккаунтов Максимум 5 символов.';
$txtaddgr1 = 'Комментарий Максимум 50 символов.';
$txtaddgr2 = 'Для начала работы с аккаунтами создайте группу для них';
$txtaddgr3 = 'Введите имя сервера. В настройках Zenno укажите такой же. Максимум 5 символов.';
$txtaddgr4 = 'Если вы работаете с помощью нескольких лицензий программы, то можете создать несколько серверов и управлять задачами из одной панели';
$txtindex1 = '<p>Друзья. Совершенно по независящим от меня причинам выпуск данного релиза FBcombo безобразно задержался</p>
				<p>Сейчас все режимы готовы. Идет проверка работы в потоках и ловля всевозможных ошибок. Потому я неоттестированные режимы оставил неактивными. Для начала работы все готово. Можно начинать работу новыми аккаунтами.</p>
				<p>Все режимы максимально быстро тоже будут доступны. Обновления программы будут по возможности, как всегда ежедневными, а то и несколько раз в день. Ровно так быстро на сколько позволит обстановка у нас в стране. К сожалению очень мешают работать совершенно неконтролируемые выключения света из-за войны.</p>
				<p>По всем вопросам и идеями новых режимовпишите разработчику в телеграм. Будем добавлять возможное и полезное.</p>
				<p>Об обновлениях программы следите в закрытом чате. Подробности буду описывать там</p>
				<p>Кстати, накидайте идей, как должна выглядеть данная страничка) какую информацию сюда надо кидать</p>
                    <p>Спасибо за участие в тестировании нового релиза комбайна FBcombo</p>
					';
$txtserver = 'Создайте имена серверов. Их же нужно будет указать в настройках шаблона Zenno';
$txtserver1 = 'Аккаунты привязанные к данному серверу останутся без привязки, пока вы не настроете это';
$txtserver2 = 'Добавить сервер';
$txtserver3 = 'Имя сервера. Длина имени максимум 5 символов';
$txtgracc = 'Добавить группу аккаунтов';  ///!!!!!!!!!!!!!!!!!!!!!!!
$txtdelgroup = 'Аккаунты оказавшиеся вне группы попадут в группу fbcombo';
$txttask40 = 'Парсинг групп по ключевым словам';
$txtparcegr1 = 'Задайте список ключевых слов для парсинга групп Facebook и список куда парсить группы Keywords list и Groups lists';
$txtparcegr2 = 'Укажите в какой список парсить группы';
$txtexp = 'Экспорт в формате login;password;mail;password mail;phone;2fa;token;JSON coockie;дата рождения';
$txtpost1 = 'Единичное добавление постов';
$txtpost2 = 'Массовое добавление постов';
$txtpost3 = 'Это массовое добавление постов с использованием рандомных изображений. Вы можете указать папку c изображениями на сервере с Zenno (Рабочая папка\img\<strong>ПАПКА С ИЗОБРАЖЕНИЯМИ</strong>), где располагаются нужные вам изображения. Они будут биспользоваться из папки рандомно. Если в папке нет изображений или папка не указана, то будут публиковаться только текстовые сообщения. Если вам нужно публиковать посты со строгим соответствием ткст-картинка - то нажмите кнопку ниже.';
$txtpost4 = 'Имя папки. Например если изображения у вас находятся в папке Рабочая папка\img\<strong>1</strong>, то указываем <strong>1</strong> ';
$txtpost5 = 'Здесь можно ввести текст поста. Можно оставить пустым, тогда будет публиковаться только картинка без текста';
$txtpost6 = 'Выберите изображение для загрузки. Если изображение не выбрано, то будет публиковаться только текст. ВНИМАНИЕ!!! Изображение должно иметь расширение либо jpg либо png.';
$txtpost7 = 'Этот режим для добавления постов по одному. Вы можете задать посты текст + изображение, только текст, только изображение. Если вы хотите задать тексты массово и привязать к ним рандомные изображения - нажммите кнопку ниже. ';
$txtpost8 = 'Выберите список постов и сделайте настройки для режима. Выберите - могут ли аккаунты в случае, если посты все отработаны постить уже опубликованные посты. Выберите, может ли один аккаунт постить если посты уже все опубликованы публиковать посты снова';
$txtpost9 = 'Выберите список постов,какие вы хотите размещать на своих аккаунтах. ';
$txtpost10 = 'Сколько раз в сутки запускать данный режим если выбрано не одноразово';
$txtpost11 = 'Запускать один раз или ежедневно? Если выбрано один раз, то задание удалится после одного исполнения ';
$txtpost12 = 'Разрешить разным аккаунтам постить одинаковые посты?';
$txtpost13 = 'Разрешать одному аккаунту постить одинаковые посты?';
$txtpost14 = 'Если посты отработаны, но вы хотите их использовать еще несколько раз, то сделайте сброс - нажмите на кнопку ниже. Посты удалятся из лога опубликованного и можно будет их публиковать снова';
$txtpost15 = 'Сделать сброс списка';
$txtpgroup = 'Выберите настройки режима. Если постить по списку групп, то если аккаунт не в группе - аккаунт будет вступать в группу.';
$txtpgroup1 = 'Куда постить?';
$txtpgroup2 = 'Разрешить аккаунтам постить  в одни и те же группы? (в пределах 24 часов)'; //!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
$txtpgroup3 = 'Что постить?';
$txtpgroup4 = 'Разрешить аккаунтам постить одни и те же посты в группы?';
$txtpgroup5 = 'Сколько постов постить одним аккаунтом за один запуск?';
$txtpgroup6 = 'Сколько раз в день запускать этот режим';
$txtlike = 'Настройте режим лайкинга';
$txtlike1 = 'Список постов для лайков (URL lists)';
$txtlike2 = 'Сколько постов лайкать за один запуск';
$txtlike3 = 'Пауза от-до';
$txthappy = 'Настройте поздравление друзей с Днем рождения. Используйте списки комментариев (Comments List)';
$txthappy1 = 'Список поздравлений';
$txtoptions3 = 'Если прокси не рабочая менять на другую?';
$txtlogin40 = 'Ручной режим';
$txtelist1 = 'Выбор списка для редактирования';// !!!!!!!!!!!!!!!!
$txtmenu = 'Что делать с отмечеными';
$txtindex = 'Текущая версия панели';
$txtindex11 = 'Актуальная версия панели';
$txtindex2 = 'После установки обновления не забудьте нажать UPDATE в верхнем меню для обновления структуры базы данных';
$txtindex3 = '<a href="https://soft.fbcombo.com/putevoditel/">Инструкции</a>';
$txtindex4 = '<br>
                СОВЕТЫ
                <br>
                Если вы работаете без прокси - обратите внимание на количество потоков, чтоб одновременно не работало более 2-3 аккаунтов
                <br>
                Если вы работаете с одной прокси со ссылкой или с одним модемом со сменой IP при старте аккаунта - работайте в 1 поток, чтоб смена IP не мешала работе аккаунтов.
                <br>';
$txtindex5 = '<strong><p> После тестирования и запуска всех режимов, что в планах.</p></strong>
                    <p> Запуск общей базы для инвайта по гео с 750 млн пользователями FB со всего мира. Чтоб вы могли делать выгрузки для себя</p>
                    <p> Разработка новых сервисных режимов для переброски и копирования ваших списков</p>
                    <p> Ну и как всегда, жду ваших идей</p>';
$txtindex6 = '<a href="#">Как обновить</a>';
$txtindex7 = 'Техподдержка в Telegram';  //!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
$txtcomm1 = 'Выберите список, что комментировать <strong>Url lists</strong>. Можно задать адреса постов, можно использовать список постов после публикации в группы или в профили. Задайте паузу между комментированием. Укажите - надо лайкать пост какой вы комментируете. Укажите количество комментриев, какое может оставить один аккаунт под одним постом. Укажите количество постов, сколько может прокомментировать один аккаунт за один запуск. Укажите список комментариев. ';
$txtcomm2 = 'Список URL для комментариев';
$txtcomm3 = 'Список текстов комментариев';
$txtcomm4 = 'Сколько комментариев может оставить один аккаунт под одним постом или в паблике в течении суток'; //!!!!!!!!!!!!
$txtcomm5 = 'Сколько комментариев может оставить один аккаунт за один запуск';
$txtcomm6 = 'Пауза от и до. Например 2-5';
$txtcomm7 = 'Лайк поста который комментируем';
$txtpgroup6 = 'Удалять группу из списка, если в группе есть модерация постов';
$txtpgroup7 = 'Публиковать посты только в период 24 часов.';
$txtpgroup8 = 'Если аккаунт не состоит в группе, то вступать?';
$txtpgroup9 = 'Список для сбора URL постов для дальнейшей работы';//!!!!!!!!!!!!!!!!!!!!!!!!!!
$txtparseact1 ='Список URL откуда парсить';
$txtparseact2 ='Список ID куда парсить';
$txtreslist1 = 'Если вы хотите парсить с помощью списка не один раз, то сделайте сброс списка. И тогда вы сможете использовать список для парсинга еще раз.';
$txttasks1 = 'Что делаем';
$txttasks2 = 'Создать задание';
$txttasks3 = 'Создать шаблон';
$txttasks4 = 'Использовать шаблон';
$txttasks5 = 'Установить 2FA';
$txttasks6 = 'Если код есть, новый код все равно получить';
$txtinvg1 = ' Для инвайта тех кто рядом данный пункт в меню игнорируется. Используйте аккаунты с нужным городом проживания ';


