<?php
$txtset = "Settings"; // Настройки
$txtacc = 'Аккаунты';
$txtacci = 'Выбирайте действия с аккаунтами. "Пробуйте" ';
$txtsett = 'Основные настройки. Установите язык инструкций, измените логин и пароль для входа в панель';
$txtaddpr = ' Формат в котором должны быть записаны прокси:<br/><strong>protocol://login:pass@ip:port</strong> - для
                прокси с логином/паролем<br/><strong>protocol://ip:port</strong> - для прокси без
                логина/пароля<br/><span class="text-danger">Важно:</span> если у вас http или https прокси, то это не указывайте!!!';
$txtnewline = 'Each entry with a new line';
$txtcomm = 'comment';
$txtaddacc1 = 'Формат в котором должны быть записаны аккаунты<br/><strong>login;password;mail;password mail;IMAP
                    pass;2fa;Phone;JSON cookie</strong><br>
                Если не создана группа <br>';
$txtaddacc2 = 'Если не создан сервер';
$txtaddacc3 = 'На какой сервер добавить аккаунты';
$txtaddacc4 = 'В Какую группу добавить аккаунты';
$txtnoreq = 'Не обязательно';
$txtaddacc = 'Добавить аккаунты';
$txtlogin = 'Выберите опции логина.';
$txtlogin1 = 'Сбор информации одноразово';
$txtlogin2 = 'Удалять телефон если подключена почта';
$txtlogin3 = 'Быстрый логин (без определения и прохождения бана)';
$txtlogin4 = 'Сбор токена';
$txtlogin5 = 'Максимум invite за 24 часа';
$txtlogin6 = 'Максимум like за 24 часа';
$txtlogin7 = 'Максимум комментариев за 24 часа';
$txtlogin8 = 'Максимум личных сообщений за 24 часа';
$txtlogin9 = 'Запуск задач не раньше чем через секунд после предыдущей';
$txtaddpr = 'Добавить прокси';
$txtlogin10 = "Разрешить работу без прокси";
$txtlogin11 = "Выполнить get запрос Для смены IP модема";
$txtlogin12 = "Выполнить файл changeip.bat. Для смены IP модема ";
$txtcook = "Опции фарма cookies";
$txtcook2 = "Количество сайтов";
$txtcook3 = "Список сайтов";
$txtaddpr1 = "Добавление прокси. Формат. ";
$txttask1 = "Выберите и настройте действия.";
$txttask2 = "Фарм cookie";
$txttask3 = "Фарм интересов";
$txttask4 = "Прокачка новорегов";
$txttask5 = "Приглашение предложенных";
$txttask6 = "Инвайт из групп";
$txttask7 = "Удалить из друзей";
$txttask8 = "Пригласить друзей на страницу";
$txttask9 = "Пригласить друзей в группу";
$txttask10 = "Пригласить друзей на донат";
$txttask11 = "Постить в профиль";
$txttask12 = "Вступить в группы";
$txttask13 = "Постинг в группы";
$txttask14 = "Комментирование";
$txttask15 = "Лайкинг публикаций";
$txttask16 = "Заполнение аккаунтов";
$txttask17 = "Like2Fan";
$txttask18 = "Рассылка лички";
$txttask19 = "Голосование";
$txttask20 = "Установка или замена почты";
$txttask21 = "Прием в друзья";
$txttask22 = "Очистка профиля от постов";
$txttask23 = "Создание страниц";
$txttask24 = "Сбор личных сообщений";
$txttask25 = "Сбор комментариев для ответов";
$txttask26 = "Поздравление с Днем рождения";
$txttask27 = "Личка комментаторам на странице";
$txttask28 = "Банхаммер";
$txtifg1 = "Инвайт в друзья из групп";
$txtifg2 = "Выберите опции приглашения в друзья из групп. Вам необходим список нужных групп. При необходимости Блек лист для игнорирования людей для приглашения, Списки для фильтров, список гео";
$txtgr = "Список групп";
$txtigr = "Вид инвайта";
$txtgeo = "Список Гео";
$txtfilter = "Фильтры";
$txtfilter1 = "Сделайте выбор при настройке фильтров имен. ALL - приглашать всех. Cyr - только кириллистические имена с учетом i. Lat - только латинские имена. Cyr + Lat - имена латиницей и кирилицей. Black - черный список имен - приглашает если имени или фамилии нет в списке. White - приглашает если имя или фамилия есть в списке. Black + White - Сначала проверяется наличие в черном списке, потом в белом списке.";
$txtfarmi1 =  "Настройте режим Фарм интересов. Режим для того, чтоб Facebook дал интересы аккаунту, начал показывать рекламу и облегчил запуск рекламных компаний.";
$txtfarmi2 = "Выберите список ключевых слов";
$txtfarmi3 = "Подписываться на страницы";
$txtfarmi4 = "Количество страниц";
$txtfarmi5 = "Вступить в группы";
$txtfarmi6 = "Количество групп";
$txtfarmi7 = "Гулять по ленте";
$txtfarmi8 = "Сколько постов лайкать в ленте";
$txtfarmi9 = "Лайкать рекламу?";
$txtfarmi10 = "Процент лайка рекламы";
$txtfarmi11 = "Сколько раз в день запускать?";
$txtfilter2 = "Выберите фильтр имен";
$txttask29 = "Фильтр имен";
$txtfilter4 = "Количество конфирмов";








